Revit 2027 API
ExternallyTaggedGeometryValidation Class
 Provides validation for geometry to be stored in an ExternallyTaggedGeometry.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExternallyTaggedGeometryValidation
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class ExternallyTaggedGeometryValidation
Public NotInheritable Class ExternallyTaggedGeometryValidation
public ref class ExternallyTaggedGeometryValidation abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ExternallyTaggedGeometryValidation = class end
The ExternallyTaggedGeometryValidation type exposes the following members.
Methods
Name | Description
IsNonSolid |  Makes sure that the input geometry object is not a Solid.
IsSolid |  Makes sure that the input geometry object is a Solid.
LacksSubnodes |  Makes sure that the input geometry object does not have sub-nodes.
Top
See Also
Reference
Autodesk.Revit.DB Namespace